"use client";

import { Title, Text } from "@/shared/ui/Typography";
import Button from "@/shared/ui/Button";
import { useRouter } from "next/navigation";

export default function PolicyPage() {
  const router = useRouter();

  return (
    <section className="flex flex-col w-[90dvw] mx-auto py-12 pb-24 gap-10">
      <Button
        variant="outline"
        size="inline"
        onClick={() => router.back()}
        className="w-fit border-gray-300 hover:border-black hover:bg-gray-50 transition-colors gap-3"
      >
        <span className="text-xl">←</span>
        <Text level={4} className="font-bold">
          Назад
        </Text>
      </Button>

      <div className="flex flex-col gap-8">
        <Title level={1}>
          Политика в отношении обработки персональных данных
        </Title>

        <div className="flex flex-col gap-6 text-gray-800 bg-white p-8 sm:p-12 rounded-[2.5rem] shadow-sm">
          <div>
            <Title level={4} className="mb-2">
              1. Общие положения
            </Title>
            <Text level={4} className="leading-relaxed">
              Настоящая политика обработки персональных данных составлена в
              соответствии с требованиями Федерального закона от 27.07.2006.
              №152-ФЗ «О персональных данных» (далее — Закон о персональных
              данных) и определяет порядок обработки персональных данных и меры
              по обеспечению безопасности персональных данных, предпринимаемые
              Студенческим советом ИУ (далее — Оператор).
              <br />
              <br />
              1.1. Оператор ставит своей важнейшей целью и условием
              осуществления своей деятельности соблюдение прав и свобод человека
              и гражданина при обработке его персональных данных, в том числе
              защиты прав на неприкосновенность частной жизни, личную и семейную
              тайну.
              <br />
              1.2. Настоящая политика Оператора в отношении обработки
              персональных данных (далее — Политика) применяется ко всей
              информации, которую Оператор может получить о посетителях
              веб-сайта https://studiu.ru.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              2. Основные понятия, используемые в Политике
            </Title>
            <Text level={4} className="leading-relaxed">
              2.1. Автоматизированная обработка персональных данных — обработка
              персональных данных с помощью средств вычислительной техники.
              <br />
              2.2. Блокирование персональных данных — временное прекращение
              обработки персональных данных (за исключением случаев, если
              обработка необходима для уточнения персональных данных).
              <br />
              2.3. Веб-сайт — совокупность графических и информационных
              материалов, а также программ для ЭВМ и баз данных, обеспечивающих
              их доступность в сети интернет по сетевому адресу
              https://studiu.ru.
              <br />
              2.4. Информационная система персональных данных — совокупность
              содержащихся в базах данных персональных данных, и обеспечивающих
              их обработку информационных технологий и технических средств.
              <br />
              2.5. Обезличивание персональных данных — действия, в результате
              которых невозможно определить без использования дополнительной
              информации принадлежность персональных данных конкретному
              Пользователю или иному субъекту персональных данных.
              <br />
              2.6. Обработка персональных данных — любое действие (операция) или
              совокупность действий (операций), совершаемых с использованием
              средств автоматизации или без использования таких средств с
              персональными данными, включая сбор, запись, систематизацию,
              накопление, хранение, уточнение (обновление, изменение),
              извлечение, использование, передачу (распространение,
              предоставление, доступ), обезличивание, блокирование, удаление,
              уничтожение персональных данных.
              <br />
              2.7. Оператор — государственный орган, муниципальный орган,
              юридическое или физическое лицо, самостоятельно или совместно с
              другими лицами организующие и (или) осуществляющие обработку
              персональных данных, а также определяющие цели обработки
              персональных данных, состав персональных данных, подлежащих
              обработке, действия (операции), совершаемые с персональными
              данными.
              <br />
              2.8. Персональные данные — любая информация, относящаяся прямо или
              косвенно к определенному или определяемому Пользователю веб-сайта
              https://studiu.ru.
              <br />
              2.9. Пользователь — любой посетитель веб-сайта https://studiu.ru.
              <br />
              2.10. Предоставление персональных данных — действия, направленные
              на раскрытие персональных данных определенному лицу или
              определенному кругу лиц.
              <br />
              2.11. Распространение персональных данных — любые действия,
              направленные на раскрытие персональных данных неопределенному
              кругу лиц (передача персональных данных) или на ознакомление с
              персональными данными неограниченного круга лиц, в том числе
              обнародование персональных данных в средствах массовой информации,
              размещение в информационно-телекоммуникационных сетях или
              предоставление доступа к персональным данным каким-либо иным
              способом.
              <br />
              2.12. Трансграничная передача персональных данных — передача
              персональных данных на территорию иностранного государства органу
              власти иностранного государства, иностранному физическому или
              иностранному юридическому лицу.
              <br />
              2.13. Уничтожение персональных данных — любые действия, в
              результате которых персональные данные уничтожаются безвозвратно с
              невозможностью дальнейшего восстановления содержания персональных
              данных в информационной системе персональных данных и (или)
              уничтожаются материальные носители персональных данных.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              3. Основные права и обязанности Оператора
            </Title>
            <Text level={4} className="leading-relaxed">
              3.1. Оператор имеет право:
              <br />
              — получать от субъекта персональных данных достоверные информацию
              и/или документы, содержащие персональные данные;
              <br />
              — в случае отзыва субъектом персональных данных согласия на
              обработку персональных данных Оператор вправе продолжить обработку
              персональных данных без согласия субъекта персональных данных при
              наличии оснований, указанных в Законе о персональных данных;
              <br />
              — самостоятельно определять состав и перечень мер, необходимых и
              достаточных для обеспечения выполнения обязанностей,
              предусмотренных Законом о персональных данных и принятыми в
              соответствии с ним нормативными правовыми актами, если иное не
              предусмотрено Законом о персональных данных или другими
              федеральными законами.
              <br />
              3.2. Оператор обязан:
              <br />
              — предоставлять субъекту персональных данных по его просьбе
              информацию, касающуюся обработки его персональных данных;
              <br />
              — организовывать обработку персональных данных в порядке,
              установленном действующим законодательством РФ;
              <br />
              — отвечать на обращения и запросы субъектов персональных данных и
              их законных представителей в соответствии с требованиями Закона о
              персональных данных;
              <br />
              — сообщать в уполномоченный орган по защите прав субъектов
              персональных данных по запросу этого органа необходимую информацию
              в течение 30 дней с даты получения такого запроса;
              <br />
              — публиковать или иным образом обеспечивать неограниченный доступ
              к настоящей Политике в отношении обработки персональных данных;
              <br />
              — принимать правовые, организационные и технические меры для
              защиты персональных данных от неправомерного или случайного
              доступа к ним, уничтожения, изменения, блокирования, копирования,
              предоставления, распространения персональных данных, а также от
              иных неправомерных действий в отношении персональных данных;
              <br />
              — прекратить передачу (распространение, предоставление, доступ)
              персональных данных, прекратить обработку и уничтожить
              персональные данные в порядке и случаях, предусмотренных Законом о
              персональных данных;
              <br />— исполнять иные обязанности, предусмотренные Законом о
              персональных данных.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              4. Основные права и обязанности субъектов персональных данных
            </Title>
            <Text level={4} className="leading-relaxed">
              4.1. Субъекты персональных данных имеют право:
              <br />
              — получать информацию, касающуюся обработки его персональных
              данных, за исключением случаев, предусмотренных федеральными
              законами. Сведения предоставляются субъекту персональных данных
              Оператором в доступной форме, и в них не должны содержаться
              персональные данные, относящиеся к другим субъектам персональных
              данных, за исключением случаев, когда имеются законные основания
              для раскрытия таких персональных данных. Перечень информации и
              порядок ее получения установлен Законом о персональных данных;
              <br />
              — требовать от оператора уточнения его персональных данных, их
              блокирования или уничтожения в случае, если персональные данные
              являются неполными, устаревшими, неточными, незаконно полученными
              или не являются необходимыми для заявленной цели обработки, а
              также принимать предусмотренные законом меры по защите своих прав;
              <br />
              — выдвигать условие предварительного согласия при обработке
              персональных данных в целях продвижения на рынке товаров, работ и
              услуг;
              <br />
              — на отзыв согласия на обработку персональных данных;
              <br />
              — обжаловать в уполномоченный орган по защите прав субъектов
              персональных данных или в судебном порядке неправомерные действия
              или бездействие Оператора при обработке его персональных данных;
              <br />
              — на осуществление иных прав, предусмотренных законодательством
              РФ.
              <br />
              4.2. Субъекты персональных данных обязаны:
              <br />
              — предоставлять Оператору достоверные данные о себе;
              <br />
              — сообщать Оператору об уточнении (обновлении, изменении) своих
              персональных данных.
              <br />
              4.3. Лица, передавшие Оператору недостоверные сведения о себе,
              либо сведения о другом субъекте персональных данных без согласия
              последнего, несут ответственность в соответствии с
              законодательством РФ.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              5. Оператор может обрабатывать следующие персональные данные
              Пользователя
            </Title>
            <Text level={4} className="leading-relaxed">
              5.1. Фамилия, имя, отчество.
              <br />
              5.2. Электронный адрес.
              <br />
              5.3. Номера телефонов.
              <br />
              5.4. Ссылки на профили в социальных сетях (Telegram, VK).
              <br />
              5.5. Сведения об учебной группе, курсе и факультете.
              <br />
              5.6. Сведения о профессиональных навыках, интересах и опыте работы
              (заполняемые в анкете).
              <br />
              5.7. Также на сайте происходит сбор и обработка обезличенных
              данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов
              интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).
              <br />
              5.8. Вышеперечисленные данные далее по тексту Политики объединены
              общим понятием Персональные данные.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              6. Цели обработки персональных данных
            </Title>
            <Text level={4} className="leading-relaxed">
              6.1. Цель обработки персональных данных Пользователя:
              <br />
              — информирование Пользователя посредством отправки электронных
              писем;
              <br />
              — предоставление доступа Пользователю к сервисам, информации и/или
              материалам, содержащимся на веб-сайте;
              <br />
              — проведение отбора кандидатов в члены Студенческого совета;
              <br />
              — установление с Пользователем обратной связи, включая направление
              уведомлений, запросов.
              <br />
              6.2. Также Оператор имеет право направлять Пользователю
              уведомления о новых продуктах и услугах, специальных предложениях
              и различных событиях. Пользователь всегда может отказаться от
              получения информационных сообщений, направив Оператору письмо на
              адрес электронной почты studsovet.iu@yandex.ru с пометкой «Отказ от
              уведомлений о новых продуктах и услугах и специальных
              предложениях».
              <br />
              6.3. Обезличенные данные Пользователей, собираемые с помощью
              сервисов интернет-статистики, служат для сбора информации о
              действиях Пользователей на сайте, улучшения качества сайта и его
              содержания.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              7. Правовые основания обработки персональных данных
            </Title>
            <Text level={4} className="leading-relaxed">
              7.1. Правовыми основаниями обработки персональных данных
              Оператором являются:
              <br />
              — Федеральный закон от 27.07.2006 N 152-ФЗ «О персональных
              данных»;
              <br />
              — Уставные документы Студенческого совета;
              <br />
              — Согласия Пользователей на обработку персональных данных.
              <br />
              7.2. Оператор обрабатывает персональные данные Пользователя только
              в случае их заполнения и/или отправки Пользователем самостоятельно
              через специальные формы, расположенные на сайте https://studiu.ru.
              Заполняя соответствующие формы и/или отправляя свои персональные
              данные Оператору, Пользователь выражает свое согласие с данной
              Политикой.
              <br />
              7.3. Оператор обрабатывает обезличенные данные о Пользователе в
              случае, если это разрешено в настройках браузера Пользователя
              (включено сохранение файлов «cookie» и использование технологии
              JavaScript).
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              8. Порядок сбора, хранения, передачи и других видов обработки
              персональных данных
            </Title>
            <Text level={4} className="leading-relaxed">
              Безопасность персональных данных, которые обрабатываются
              Оператором, обеспечивается путем реализации правовых,
              организационных и технических мер, необходимых для выполнения в
              полном объеме требований действующего законодательства в области
              защиты персональных данных.
              <br />
              8.1. Оператор обеспечивает сохранность персональных данных и
              принимает все возможные меры, исключающие доступ к персональным
              данным неуполномоченных лиц.
              <br />
              8.2. Персональные данные Пользователя никогда, ни при каких
              условиях не будут переданы третьим лицам, за исключением случаев,
              связанных с исполнением действующего законодательства.
              <br />
              8.3. В случае выявления неточностей в персональных данных,
              Пользователь может актуализировать их самостоятельно, путем
              направления Оператору уведомление на адрес электронной почты
              Оператора studsovet.iu@yandex.ru с пометкой «Актуализация
              персональных данных».
              <br />
              8.4. Срок обработки персональных данных определяется достижением
              целей, для которых они были собраны, если иной срок не
              предусмотрен договором или действующим законодательством.
              Пользователь может в любой момент отозвать свое согласие на
              обработку персональных данных, направив Оператору уведомление
              посредством электронной почты на электронный адрес Оператора
              studsovet.iu@yandex.ru с пометкой «Отзыв согласия на обработку
              персональных данных».
              <br />
              8.5. Вся информация, которая собирается сторонними сервисами, в
              том числе платежными системами, средствами связи и другими
              поставщиками услуг, хранится и обрабатывается указанными лицами
              (Операторами) в соответствии с их Пользовательским соглашением и
              Политикой конфиденциальности. Субъект персональных данных и/или
              Пользователь обязан самостоятельно своевременно ознакомиться с
              указанными документами. Оператор не несет ответственность за
              действия третьих лиц, в том числе указанных в настоящем пункте
              поставщиков услуг.
            </Text>
          </div>

          <div>
            <Title level={4} className="mb-2">
              9. Заключительные положения
            </Title>
            <Text level={4} className="leading-relaxed">
              9.1. Пользователь может получить любые разъяснения по интересующим
              вопросам, касающимся обработки его персональных данных,
              обратившись к Оператору с помощью электронной почты
              studsovet.iu@yandex.ru.
              <br />
              9.2. В данном документе будут отражены любые изменения политики
              обработки персональных данных Оператором. Политика действует
              бессрочно до замены ее новой версией.
              <br />
              9.3. Актуальная версия Политики в свободном доступе расположена в
              сети Интернет по адресу https://studiu.ru/policy.
            </Text>
          </div>
        </div>
      </div>
    </section>
  );
}
